package Lesson8.Task2;

/**
Романтичесская )
 Принцесса приезжает на каникулы в замок и будет там 10 дней.
 В этом замке 10 спален, принцесса каждую ночь ночует в новой соседней спальне.
 Принцесса не ночует в уже посещенной спальне и ту спальню в которой она уже ночевала она оставляет открытой.
 Принцесса открывает эту спальню в которой уже начевала.
 Задача принца найти принцессу.
 Принц может один раз в сутки стучать в одну спальню.
 Задача принца найти принцессу как можно быстрее.
 */
public class Task6 {

        public static void main(String[] args) {
            Princess princess = new Princess(15); // 15
            princess.action();
        }

    }


