package Lesson11.Task3;

/**
 Написать систему, которая продает билеты на поезд, 1 рейс 1го поезда.
 Поезд это множество вагонов, вагоны разных типов, плацкарт, купе, спальные.
 В кассе 2 метода, купить билет и вернуть билет.

 1 вопрос, какие будут классы в этой системе и какую они будут составлять иерархию.
 2 вопрос, какие поля и методы будут в каждом типе.
 3 вопрос, как будут взаимодействовать обьекты этих классов
 */

public class MainCassa {
    public static void main(String[] args) {

    }
}
